---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalyticalElement..::..Parameter Property
AnalyticalElement Class See Also Send Feedback
---

Retrieves a parameter from the element given an identifier.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md) | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
|  | [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md) | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
|  | [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md) | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |

# See Also

AnalyticalElement Class

AnalyticalElement Members

Autodesk.Revit.DB.Structure Namespace